{
  "general": {
    "app" : {
      "mainTitle" : "Tech Talk with Capgemini Special Edition"
    }
  },
  "agenda": {
    "days": [
      {
        "id": 1,
        "date": "2019-03-01",
        "timeSlots": [
          {
            "id": 101,
            "startTime": "08:00",
            "endTime": "09:00",
            "name": "Registration, Coffee, Breakfast",
            "isBreak": true
          },
          {
            "id": 102,
            "startTime": "09:00",
            "endTime": "09:15",
            "name": "Welcome + Organisation",
            "room": "JavaScript Room 9",
            "isBreak": false
          },
          {
            "id": 103,
            "startTime": "09:15",
            "endTime": "10:15",
            "name": "Keep Betting On JavaScript",
            "talk": 1,
            "presenters": [1],
            "room": "JavaScript Room 9",
            "isBreak": false
          },
          {
            "id": 104,
            "startTime": "10:15",
            "endTime": "11:00",
            "name": "Serverless Java on Kubernetes",
            "talk": 2,
            "presenters": [3],
            "room": "Java Room 6",
            "stream": 1,
            "isBreak": false
          },
          {
            "id": 105,
            "startTime": "10:15",
            "endTime": "11:00",
            "name": "Stop building monolithic frontends!",
            "room": "JavaScript Room 9",
            "talk": 3,
            "presenters": [4],
            "stream": 2,
            "isBreak": false
          },
          {
            "id": 106,
            "startTime": "11:00",
            "endTime": "11:15",
            "name": "Coffee break",
            "isBreak": true
          },
          {
            "id": 107,
            "startTime": "11:15",
            "endTime": "12:00",
            "name": "Zmiana kodowania ISO8859 na UTF8 - migracja bazy Oracle 12c",
            "talk": 4,
            "presenters": [12],
            "room": "Java Room 6",
            "stream": 1,
            "isBreak": false
          },
          {
            "id": 108,
            "startTime": "11:15",
            "endTime": "12:00",
            "name": "Hybrid Mobile App Development with Ionic",
            "talk": 5,
            "room": "JavaScript Room 9",
            "presenters": [13],
            "stream": 2,
            "isBreak": false
          },
          {
            "id": 109,
            "startTime": "12:00",
            "endTime": "12:45",
            "name": " Distributed system integration using Apache Camel and Spring Boot",
            "room": "Java Room 6",
            "talk": 6,
            "presenters": [6],
            "stream": 1,
            "isBreak": false
          },
          {
            "id": 110,
            "startTime": "12:00",
            "endTime": "12:45",
            "name": "JavaScript w cyberprzestrzeni hakerów",
            "room": "JavaScript Room 9",
            "talk": 7,
            "presenters": [5],
            "stream": 2,
            "isBreak": false
          },
          {
            "id": 111,
            "startTime": "12:45",
            "endTime": "13:20",
            "name": "Heal the code make it a better place. Power of code review",
            "talk": 8,
            "presenters": [7],
            "room": "Java Room 6",
            "stream": 1,
            "isBreak": false
          },
          {
            "id": 112,
            "startTime": "12:45",
            "endTime": "13:20",
            "name": "Web Components czyli Angular, React i VanillaJS w jednym stali DOM-u",
            "room": "JavaScript Room 9",
            "talk": 9,
            "presenters": [8],
            "stream": 2,
            "isBreak": false
          },
          {
            "id": 113,
            "startTime": "13:20",
            "endTime": "14:20",
            "name": "Lunch break",
            "isBreak": true
          },
          {
            "id": 114,
            "startTime": "14:20",
            "endTime": "15:00",
            "name": "Zastosowanie podejścia Consumer Driven Contracts w architekturze Mikroserwisów",
            "room": "Java Room 6",
            "talk": 10,
            "presenters": [9],
            "stream": 1,
            "isBreak": false
          },
          {
            "id": 115,
            "startTime": "14:20",
            "endTime": "15:00",
            "name": "Vue.js: Come on! yet another JavaScript framework?!",
            "talk": 11,
            "presenters": [10, 11],
            "room": "JavaScript Room 9",
            "stream": 2,
            "isBreak": false
          },
          {
            "id": 116,
            "startTime": "15:00",
            "endTime": "16:00",
            "name": "I jeszcze jeden język...",
            "talk": 20,
            "presenters": [2],
            "room": "JavaScript Room 9",
            "isBreak": false
          },
          {
            "id": 117,
            "startTime": "16:00",
            "endTime": "16:15",
            "name": "Closing",
            "room": "JavaScript Room 9",
            "isBreak": false
          }
        ]
      }
    ],

    "streams": [
      {
        "id": 1,
        "name": "Java",
        "color": "#ff304c"
      },
      {
        "id": 2,
        "name": "JavaScript",
        "color": "#0070ad"
      }
    ]
  },

  "talks": [
    {
      "id": 1,
      "title": "Keep Betting On JavaScript",
      "description": "Brendan Eich's famous quip, \"Always bet on JavaScript\", revels in JS's history of naysayers predicting that we'd eventually reach a point where JS couldn't grow to meet the demands of modern development; it turns out those have always been bad bets.\nIt's safe to say JS is no longer trying to prove itself. It has arrived.\nBut where is it headed, and what does that mean for us?",
      "presenters": [1]
    },
    {
      "id": 2,
      "title": "Serverless Java on Kubernetes",
      "description": "Od lat obserwujemy zmiany w sposobie implementacji aplikacji przeznaczonych do wdrażania w chmurze. Kubernetes czy Istio zrewolucjonizowały sposób wdrażania mikroserwisów, pozwalając na przerzucenie na infrastrukturę części funkcjonalności, odpowiedzialnych m.in. za niezawodność systemów, implementowanych wcześniej przy pomocy takich bibliotek jak Netflix OSS.  Rozwój technologii serverless pozwolił programistom skupić się tylko na kodzie aplikacji i nie myśleć o aspektach wdrażania aplikacji czy zarządzania infrastrukturą.\nObecnie coraz częściej aplikacje w chmurze składają się zarówno z mikro-serwisów, jak i funkcji, opakowanych jako kontenery i wdrożonych przez Kubernetesa na serwerach lub w dowolnej chmurze.\nPodczas wykładu pokażę, w jaki sposób zaimplementować w Javie natywne aplikacje chmurowe oraz wdrożyć je, wykorzystując platformę Kubernetes / Openshift oraz Apache OpenWhisk - rozwiązanie open source dla Function-as-a-Service (FaaS).",
      "presenters": [3]
    },
    {
      "id": 3,
      "title": "Stop building monolithic frontends!",
      "description": "Od dobrych już kilku lat budujemy aplikacje w oparciu o mikroserwisy. W pewnym momencie okazuje się, że, owszem, backend spełnia założenia tego sylu w architekturze, ale frontend to już monolit w czystym wydaniu. Mina architekta, gdy klient oświadcza, że nowy mikroserwis będzie realizowany przez nowego dostawcę... bezcenna.\nW trakcie prezentacji pokażę kilka podejść do projektowania frontendu w architekturze mikroserwisów. Co więcej, podzielę się rozwiązaniami i doświadczeniami z rzeczywistych projektów, które miałem okazję prowadzić. A wszystko to poparte przykładami w kodzie. Jedno jest pewne – nikt nie będzie się nudził!",
      "presenters": [4]
    },
    {
      "id": 4,
      "title": "Zmiana kodowania ISO8859 na UTF8 - migracja bazy Oracle 12c",
      "description": "Ze względu na rosnący zakres działania aplikacji, może się zdarzyć potrzeba migracji aplikacji do pełnego zestawu znaków, czyli UTF8 (głównie ze względu na mnogość obsługiwanych języków i znaków specjalnych). Co za tym idzie baza musi przejść podobny proces. W czasie mojej prezentacji postaram się przedstatawić ogólny zarys calego przedsięwzięcia, ale także  najciekawsze i najtrudniejsze problemy, z którymi należy się liczyć w czasie takiej operacji. Aplikacja Java połączona z bazą Oracle stanowi nie lada wyzwanie.",
      "presenters": [12]
    },
    {
      "id": 5,
      "title": "Hybrid Mobile App Development with Ionic",
      "description": "Natywne apki czy może hybrydowe? Celem prezentacji jest przybliżenie uczestnikom podstawowych zagadnień związanych z tworzeniem hybrydowych aplikacji mobilnych w podejściu “write once, run anywhere”, przy użyciu Ionic Framework. Opowiem o genezie hybrydowych aplikacji mobilnych, o architekturze i możliwych zastosowaniach Ionic Framework.",
      "presenters": [13]
    },
    {
      "id": 6,
      "title": "Distributed system integration using Apache Camel and Spring Boot",
      "description": "Integracja systemów to niełatwy temat, choćby ze względu to na skomplikowany przepływ informacji, mnogość protokołów komunikacyjnych, jak i wiele formatów przetwarzanych danych.\n\nPodczas prelekcji przedstawię koncepcję rozproszonej integracji systemów - tzw. \"Agile Integration\". Zaprezentuję framework Apache Camel, który znakomicie sprawdza się w takiej architekturze i rozwiązuje wiele problemów technicznych oraz biznesowych spotykanych podczas integracji systemów. Dodatkowo przedstawię projekt zrealizowany w Capgemini przy użyciu wspomnianych technologii.",
      "presenters": [6]
    },
    {
      "id": 7,
      "title": "JavaScript w cyberprzestrzeni hakerów",
      "description": "Cyberprzestępcy coraz odważniej wykorzystują technologie związane z JavaScript, tworząc nowy front walki ze złem. Galopujące tempo rozwoju nowych technologii JS obliguje nas do poznawania nowych zagrożeń oraz technik obronnych. Jeśli jesteś deweloperem,  powinieneś znać podstawowe ryzyko wynikające w technologii JavaScript - a podczas tej prezentacji poznasz sposoby walki i obrony pomyślane na bazie ostatnich cyberataków wymierzonych w kradzież wrażliwych danych oraz rozpowszechniania złośliwego oprogramowania.",
      "presenters": [5]
    },
    {
      "id": 8,
      "title": "Heal the code make it a better place. Power of code review",
      "description": "Oddając swój kod do review czujesz strach i dreszcze? A może code review jest dla Ciebie jak yeti, którego nigdy nie widziałeś? Czas poznać jasną stronę tego procesu. Podczas mojego wystąpienia opowiem, czego uczę się dzięki code review, jakie korzyści przynosi dla mojego zespołu, a także podzielę się wskazówkami, jak przenieść swoje code review na wyższy poziom lub zacząć stosować je w swoim projekcie.",
      "presenters": [7]
    },
    {
      "id": 9,
      "title": "Web Components czyli Angular, React i VanillaJS w jednym stali DOM-u",
      "description": "Mówi się, że rok 2019 to rok Web Components. Podczas wystąpienia przedstawię czym one są i do czego służą. Jak zabrać się do stworzenia Web Components, jak zintegrować je z istniejącymi aplikacjami i na co uważać podczas korzystania z tej technologii?",
      "presenters": [8]
    },
    {
      "id": 10,
      "title": "Zastosowanie podejścia Consumer Driven Contracts w architekturze Mikroserwisów",
      "description": "Architektura oparta na mikroserwisach jest aktualnie bardzo popularna i oferuje szereg korzyści. Jej zalety idą jednak w parze z szeregiem wyzwań.  Ewolucja istniejących oraz implementacja kolejnych mikroserwisów sprawia, że testowanie integracji oraz utrzymywanie kontraktów pomiędzy nimi staje się wyzwaniem.  Jeżeli odbywa się to w projekcie, który ma wiele ścieżek rozwoju i wiele zespołów pracujących jednocześnie nad rozwojem usług, to mogłoby się wydawać, że mamy gotowy scenariusz na porażkę. Czy jednak na pewno tak musi być?",
      "presenters": [9]
    },
    {
      "id": 11,
      "title": "Vue.js: Come on! yet another JavaScript framework?!",
      "description": "Masz dość walki z zależnościami?  Czy może migracja do nowszych wersji frameworków nie pozwala Ci spać? A może chcesz wprowadzić elementy SPA do swojego projektu, lecz ograniczenia budżetowe nie pozwalają Ci napisać wszystkiego od nowa? Vue.js jest lekką biblioteką, która może Cię zainteresować. Pokażemy Ci, jak łatwo dodać ją do swojego projektu, a także, jak tworzyć aplikacje w sposób profesjonalny i skalowalny.",
      "presenters": [10, 11]
    },
    {
      "id": 20,
      "title": "I jeszcze jeden język...",
      "description": "Nieważne jaki język znasz i w jakim frameworku piszesz, pewnie za rok dwa, może pięć  będziesz musiał się czegoś nowego nauczyć. To piękno, ale i przekleństwo pracy programisty.\nDlaczego tak jest? Dlaczego nie można po prostu nauczyć się jednej technologii, zrobić certyfikat i dojechać tak do emerytury. Poświęcając czas na inne hobby i rodzinę zamiast na ciągłe dokształcanie.\nA może się da?\nO ewolucji języków programowania. Czemu raczej nie piszemy w FORTRANIE? Komu przeszkadzał ALGOL? Dlaczego programowanie funkcyjne jest starsze niż assembler? I jak przy wszystkim wygląda krótka historia C++, Javy i  C#? Gdzie to zmierza? - i dlaczego nie do Scali :-) ? - o tym będzie ta opowieść.",
      "presenters": [2]
    }
  ],

  "presenters": [
    {
      "id": 1,
      "name": "Kyle Simpson",
      "description": "An evangelist of the Open Web, passionate about all things JavaScript. He writes, speaks, teaches, and contributes to OSS.",
      "imgSrc": "assets/img/kyle-simpson.jpg"
    },
    {
      "id": 2,
      "name": "Jarek Ratajski",
      "description": "Programowania nauczyłem się na komputerze C64 dysponującym przepastną ilością 64kb RAM (i komu to przeszkadzało?!). A od tego czasu przewinąłem się przez kilka języków programowania: C,C++, Java, JavaScript. Scala, oraz różnych dziwnych frameworków: Spring, JavaEE, JSF(niestety), AngularJS, React. Przez ostatnich wiele lat(wstyd pisać ile) byłem m.in programistą, szefem zespołu, architektem, ale też sprzedawcą i producentem filmowym :-). Pracowałem, dla banków, firm ubezpieczeniowych, a także próbowałem swoich sił jako Janusz Biznesu. Obecnie pracuje dla CSS Versicherung u krasnoludów, w mieście pod górą. Czasami prowadzę wykłady na konferencjach takich jak Devoxx, Voxxed days, Geecon, 4Developers, JDD oraz rozmaitych JUGach. Główny mój temat to walka z technologiami, które już dawno przestały być użyteczne, ale tego nie zauważyliście. Bo nie patrzycie uważnie!",
      "imgSrc": "assets/img/jarek-ratajski.png"
    },
    {
      "id": 3,
      "name": "Krzysztof Sobkowiak",
      "description": "Programista Java i starszy architekt oprogramowania w Capgemini – a do tego członek Apache Software Foundation, który wędruje po górach, ogląda horrory i kocha festiwale muzyki metalowej.",
      "imgSrc": "assets/img/krzysztof-sobkowiak.jpg"
    },
    {
      "id": 4,
      "name": "Marek Matczak",
      "description": "Developer i architekt z piętnastoletnim doświadczeniem, specjalizujący się w rozwiązaniach webowych. Swoje pierwsze programistyczne kroki stawiał programując w BASICu na Atari 65XE, zapisując swoje programy dla potomnych na... taśmie magnetofonowej! Później programował również w takich językach, jak Pascal, C, C++, Java, a od kilku lat również JavaScript.",
      "imgSrc": "assets/img/marek-matczak.jpg"
    },
    {
      "id": 5,
      "name": "Maksymilian Arciemowicz",
      "description": "Starszy Architekt w Capgemini Software Solutions Center – z zamiłowania ekspert od cyberbezpieczeństwa. Autor popularnego bloga CXSECURITY, wieloletni badacz poziomu bezpieczeństwa standardowych bibliotek i aplikacji, takich jak libc, Apple, Oracle i innych.",
      "imgSrc": "assets/img/maksymilian-arciemowicz.jpg"
    },
    {
      "id": 6,
      "name": "Wojciech Pazda",
      "description": "Java Developer w Capgemini Software Solutions Center w Poznaniu.  Pasjonat  integracji systemów przy użyciu najnowszych koncepcji i  technologii, którymi zainteresował się pracując dla dużego klienta z  branży Automotive. A po godzinach oddaje się swojej drugiej pasji – żeglarstwu morskiemu.",
      "imgSrc": "assets/img/wojciech-pazda.jpg"
    },
    {
      "id": 7,
      "name": "Zuzanna Pacholczyk",
      "description": "Starsza inżynier oprogramowania w Capgemini Software Solutions Center. Prężnie działa w Craftsmanship Community, bo uwielbia dzielić się wiedzą. A w wolnym czasie – ćwiczy jogę, czyta książki i dzierga na drutach.",
      "imgSrc": "assets/img/zuzanna-pacholczyk.jpg"
    },
    {
      "id": 8,
      "name": "Michał Jawulski",
      "description": "Od ponad siedmiu lat projektuje  systemy dla firm finansowych z całego świata – to prawdziwy pasjonat nowych technologii  i inżynierii oprogramowania. Poza tym – wierny kibic Premier League, który relaksuje się, grając w Fifę.",
      "imgSrc": "assets/img/michal-jawulski.jpg"
    },
    {
      "id": 9,
      "name": "Łukasz Parczewski",
      "description": "Architekt Oprogramowania z ponad dziesięcioletnim stażem, realizujący projekty dla firm na całym świecie dla sektora publicznego, telekomunikacyjnego oraz finansowego. Obecnie realizuje projekt budowy nowoczesnej platformy do obsługi płatności dla jednej z największych sieci płatniczych na świecie, w którym zastosowano między innymi wzorzec Consumer-Driven Contracts.",
      "imgSrc": "assets/img/lukasz-parczewski.jpg"
    },
    {
      "id": 10,
      "name": "Maciej Małecki",
      "description": "Pierwsze kroki w programowaniu stawiał w burzliwym roku 1990, a z branżą IT jest zawodowo związany od niemniej burzliwego roku 2002-go. Był (i nadal jest) świadkiem narodzin nowych technologii, zmierzchu starych technologii, tworzenia się nowych mód, przemijania starych oraz rośnięciu i pękaniu baniek. Cały czas nie może zrozumieć, dlaczego kod aplikacji biznesowych po odpowiednio długim czasie zaczyna przypominać pewną słynną włoską potrawę.",
      "imgSrc": "assets/img/maciek-malecki.jpg"
    },
    {
      "id": 11,
      "name": "Justyna Bytner",
      "description": "Zaczynała pracę jako programistka JAVY w Capgemini – i to od razu z wysokiego C, bo od bardzo odpowiedzialnego zadania projektowego w rozproszonym środowisku dla międzynarodowych klientów. Dziś w jej przypadku trudno o typowy dzień w pracy. Tworzy architekturę systemu, uczestniczy w spotkaniach biznesowych i zajmuje się ofertowaniem.",
      "imgSrc": "assets/img/justyna-bytner.png"
    },
    {
      "id": 12,
      "name": "Konrad Kuna",
      "description": "Zajmuje się administracją systemów informatycznych w praktyce. Doświadczony w temacie sprzętowej budowy systemu i jego wymagań  performance’owych. Od okolo 11 lat zajmuje się głównie administracją baz danych. Wcześniej bazy Microsoft MSSQL, a od 5 lat wyłącznie Oracle.",
      "imgSrc": "assets/img/konrad-kuna.jpg"
    },
    {
      "id": 13,
      "name": "Andrzej Templin",
      "description": "Starszy Inżynier Oprogramowania w Capgemini Software Solutions Center. Pasjonat technologii mobilnych. Wyróżniony przez twórców frameworka Ionic. W Capgemini pracuje w zespole rozwijającym system płatności mobilnych. W latach 2012-2018 odpowiedzialny za wdrożenia dużych systemów informatycznych w polskim sektorze publicznym. Z branżą IT związany od 20 lat.",
      "imgSrc": "assets/img/andrzej-templin.jpg"
    }
  ]
}
