{
  "general": {
    "app" : {
      "mainTitle" : "Apps DE Summit 2018"
    }
  },
  
  "agenda": {
    "days": [
      {
        "id": 2,
        "date": "2019-02-01",
        "timeSlots": [
          {
            "id": 101,
            "startTime": "08:00",
            "endTime": "09:00",
            "name": "Registration & Coffee",
            "isBreak": true
          },
          {
            "id": 102,
            "startTime": "09:00",
            "endTime": "09:15",
            "name": "Welcome + Organisation",
            "room": "Plenum",
            "isBreak": false
          },
          {
            "id": 103,
            "startTime": "09:15",
            "endTime": "10:15",
            "name": "Where do you, JavaScript, go?",
            "presenters": [1],
            "room": "Plenum",
            "isBreak": false
          },
          {
            "id": 104,
            "startTime": "10:15",
            "endTime": "11:00",
            "name": "Serverless Java with Kubernetes",
            "presenters": [3],
            "room": "Java Room",
            "stream": 1,
            "isBreak": false
          },
          {
            "id": 105,
            "startTime": "10:15",
            "endTime": "11:00",
            "name": "Stop building monolithic frontends!",
            "room": "JavaScript Room",
            "presenters": [4],
            "stream": 2,
            "isBreak": false
          },
          {
            "id": 102,
            "startTime": "11:00",
            "endTime": "11:15",
            "name": "Coffee break",
            "room": "Plenum",
            "isBreak": true
          },
          {
            "id": 104,
            "startTime": "11:15",
            "endTime": "11:45",
            "name": "Distributed system integration using Apache Camel and Spring Boot",
            "presenters": [6],
            "room": "Java Room",
            "stream": 1,
            "isBreak": false
          },
          {
            "id": 105,
            "startTime": "11:15",
            "endTime": "11:45",
            "name": "JavaScript w cyberprzestrzeni hakerów",
            "room": "JavaScript Room",
            "presenters": [5],
            "stream": 2,
            "isBreak": false
          },
          {
            "id": 106,
            "startTime": "11:45",
            "endTime": "12:15",
            "name": "Heal the code, make it a better place. Power of code review",
            "room": "Java Room",
            "presenters": [7],
            "stream": 1,
            "isBreak": false
          },
          {
            "id": 107,
            "startTime": "11:45",
            "endTime": "12:15",
            "name": "Web Components czyli Angular, React i VanillaJS w jednym stali DOM-u",
            "room": "JavaScript Room",
            "presenters": [8],
            "stream": 2,
            "isBreak": false
          },
          {
            "id": 108,
            "startTime": "12:15",
            "endTime": "12:00",
            "name": "Zastosowanie podejścia Consumer Driven Contracts w architekturze Mikroserwisów",
            "presenters": [9],
            "room": "Java Room",
            "stream": 1,
            "isBreak": false
          },
          {
            "id": 109,
            "startTime": "12:15",
            "endTime": "13:00",
            "name": "Vue.js: Come on! Yet another JavaScript framework?!",
            "room": "JavaScript Room",
            "presenters": [10, 11],
            "stream": 2,
            "isBreak": false
          },
          {
            "id": 110,
            "startTime": "13:00",
            "endTime": "14:00",
            "name": "Lunch break",
            "room": "Plenum",
            "isBreak": true
          },
          {
            "id": 111,
            "startTime": "14:00",
            "endTime": "14:45",
            "name": "Zmiana kodowania ISO8859 na UTF8 - migracja bazy Oracle 12c",
            "room": "Java Room",
            "presenters": [12],
            "stream": 1,
            "isBreak": false
          },
          {
            "id": 112,
            "startTime": "14:00",
            "endTime": "14:45",
            "name": "Wprowadzenie do tworzenia hybrydowych aplikacji mobilnych z zastosowaniem Ionic Framework",
            "presenters": [13],
            "room": "JavaScript Room",
            "stream": 2,
            "isBreak": false
          },
          {
            "id": 113,
            "startTime": "14:45",
            "endTime": "15:45",
            "name": "I jeszcze jeden język...",
            "presenters": [2],
            "room": "Plenum",
            "isBreak": false
          },
          {
            "id": 114,
            "startTime": "15:45",
            "endTime": "16:00",
            "name": "Closing",
            "room": "Plenum",
            "isBreak": false
          }
        ]
      }
    ],

    "streams": [
      {
        "id": 1,
        "name": "Java",
        "color": "#ff304c"
      },
      {
        "id": 2,
        "name": "JavaScript",
        "color": "#0070ad"
      }
    ]
  },

  "talks": [
    {
      "id": 1,
      "title": "Keep Betting On JavaScript",
      "description": "Brendan Eich's famous quip, \"Always bet on JavaScript\", revels in JS's history of naysayers predicting that we'd eventually reach a point where JS couldn't grow to meet the demands of modern development; it turns out those have always been bad bets.\nIt's safe to say JS is no longer trying to prove itself. It has arrived.\nBut where is it headed, and what does that mean for us?",
      "presenters": [1]
    },
    {
      "id": 2,
      "title": "I jeszcze jeden język...",
      "description": "Nieważne jaki język znasz i w jakim frameworku piszesz, pewnie za rok dwa, może pięć  będziesz musiał się czegoś nowego nauczyć. To piękno, ale i przekleństwo pracy programisty.\nDlaczego tak jest? Dlaczego nie można po prostu nauczyć się jednej technologii, zrobić certyfikat i dojechać tak do emerytury. Poświęcając czas na inne hobby i rodzinę zamiast na ciągłe dokształcanie.\nA może się da?\nO ewolucji języków programowania. Czemu raczej nie piszemy w FORTRANIE? Komu przeszkadzał ALGOL? Dlaczego programowanie funkcyjne jest starsze niż assembler? I jak przy wszystkim wygląda krótka historia C++, Javy i  C#? Gdzie to zmierza? - i dlaczego nie do Scali :-) ? - o tym będzie ta opowieść.",
      "presenters": [2]
    },
    {
      "id": 3,
      "title": "Zmiana kodowania ISO8859 na UTF8 - migracja bazy Oracle 12c",
      "description": "Ze względu na rosnący zakres działania aplikacji, może się zdarzyć potrzeba migracji aplikacji do pełnego zestawu znaków, czyli UTF8 (głównie ze względu na mnogość obsługiwanych języków i znaków specjalnych). Co za tym idzie baza musi przejść podobny proces. W czasie mojej prezentacji postaram się przedstatawić ogólny zarys calego przedsięwzięcia, ale także  najciekawsze i najtrudniejsze problemy, z którymi należy się liczyć w czasie takiej operacji. Aplikacja Java połączona z bazą Oracle stanowi nie lada wyzwanie.",
      "presenters": [12]
    },
    {
      "id": 4,
      "title": "Stop building monolithic frontends!",
      "description": "Od dobrych już kilku lat budujemy aplikacje w oparciu o mikroserwisy. W pewnym momencie okazuje się, że, owszem, backend spełnia założenia tego sylu w architekturze, ale frontend to już monolit w czystym wydaniu. Mina architekta, gdy klient oświadcza, że nowy mikroserwis będzie realizowany przez nowego dostawcę... bezcenna.\nW trakcie prezentacji pokażę kilka podejść do projektowania frontendu w architekturze mikroserwisów. Co więcej, podzielę się rozwiązaniami i doświadczeniami z rzeczywistych projektów, które miałem okazję prowadzić. A wszystko to poparte przykładami w kodzie. Jedno jest pewne – nikt nie będzie się nudził!",
      "presenters": [4]
    }
  ],

  "presenters": [
    {
      "id": 1,
      "name": "Kyle Simpson",
      "description": "An evangelist of the Open Web, passionate about all things JavaScript. He writes, speaks, teaches, and contributes to OSS.",
      "imgSrc": "assets/img/kyle-simpson.jpg"
    },
    {
      "id": 2,
      "name": "Jarek Ratajski",
      "description": "Programowania nauczyłem się na komputerze C64 dysponującym przepastną ilością 64kb RAM (i komu to przeszkadzało?!). A od tego czasu przewinąłem się przez kilka języków programowania: C,C++, Java, JavaScript. Scala, oraz różnych dziwnych frameworków: Spring, JavaEE, JSF(niestety), AngularJS, React. Przez ostatnich wiele lat(wstyd pisać ile) byłem m.in programistą, szefem zespołu, architektem, ale też sprzedawcą i producentem filmowym :-). Pracowałem, dla banków, firm ubezpieczeniowych, a także próbowałem swoich sił jako Janusz Biznesu. Obecnie pracuje dla CSS Versicherung u krasnoludów, w mieście pod górą. Czasami prowadzę wykłady na konferencjach takich jak Devoxx, Voxxed days, Geecon, 4Developers, JDD oraz rozmaitych JUGach. Główny mój temat to walka z technologiami, które już dawno przestały być użyteczne, ale tego nie zauważyliście. Bo nie patrzycie uważnie!",
      "imgSrc": "assets/img/jarek-ratajski.png"
    },
    {
      "id": 3,
      "name": "Krzystof Sobkowiak"
    },
    {
      "id": 4,
      "name": "Marek Matczak",
      "description": "Developer i architekt z piętnastoletnim doświadczeniem, specjalizujący się w rozwiązaniach webowych. Swoje pierwsze programistyczne kroki stawiał programując w BASICu na Atari 65XE, zapisując swoje programy dla potomnych na... taśmie magnetofonowej! Później programował również w takich językach, jak Pascal, C, C++, Java, a od kilku lat również JavaScript.",
      "imgSrc": "assets/img/marek-matczak.jpg"
    },
    {
      "id": 5,
      "name": "Maksymilian Arciemowicz"
    },
    {
      "id": 6,
      "name": "Wojciech Pazda"
    },
    {
      "id": 7,
      "name": "Zuzanna Pacholczyk"
    },
    {
      "id": 8,
      "name": "Michał Jawulski"
    },
    {
      "id": 9,
      "name": "Łukasz Parczewski"
    },
    {
      "id": 10,
      "name": "Maciej Małecki"
    },
    {
      "id": 11,
      "name": "Justyna Bytner"
    },
    {
      "id": 12,
      "name": "Konrad Kuna",
      "description": "Zajmuje się administracją systemów informatycznych w praktyce. Doświadczony w temacie sprzętowej budowy systemu i jego wymagań  performance’owych. Od okolo 11 lat zajmuje się głównie administracją baz danych. Wcześniej bazy Microsoft MSSQL, a od 5 lat wyłącznie Oracle.",
      "imgSrc": "assets/img/konrad-kuna.jpg"
    },
    {
      "id": 13,
      "name": "Andrzej Templin"
    }
  ]
}
